# specify a directory to install
cask_args appdir: "/Applications"

# Taps
tap "argoproj/tap"
tap "aws/tap"
tap "aylei/tap"
#tap "azure/draft"
#tap "azure/aks-engine"
tap "banzaicloud/tap"
#tap "bazelbuild/tap"
tap "derailed/k9s"
tap "derailed/popeye"
tap "fairwindsops/tap"
tap "getantibody/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "kryptco/tap"
tap "kube-score/tap"
#tap "solo-io/tap"
tap "liamg/tfsec"
#tap "puppetlabs/puppet"
tap "nexeck/tmuxinator"
tap "reconquest/tubekit", "https://github.com/reconquest/tubekit.git"
tap "teamookla/speedtest"
tap "versent/taps"

# Brew
brew "antibody"
#brew "autoenv"
brew "autojump"
#brew "ack"
brew "awk"
brew "aws-iam-authenticator"
brew "aws-okta"
brew "aws-shell"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "binaryen"
brew "calicoctl"
brew "certbot"
brew "cfssl"
brew "cheat"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "direnv"
brew "docker-machine-driver-vmware"
#brew "emscripten"
brew "figlet"
brew "findutils"
brew "zsh"
brew "fizsh"
brew "fluxctl"
brew "fortune"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gitlab-runner"
brew "glances"
brew "go"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "goenv"
brew "grafana"
brew "graphviz"
brew "hadolint"
brew "helm", link: false
brew "helm@2"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "istioctl"
brew "jq"
brew "kind"
brew "kops"
brew "krew"
brew "kubebuilder"
brew "kubecfg"
brew "kubectx"
brew "kustomize"
brew "lolcat"
brew "mas"
brew "mercurial"
brew "minikube"
#brew "mosh"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "nethack"
brew "ngrep"
brew "octant"
brew "pipenv"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ranger"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "rlwrap"
brew "sbtenv"
brew "scalaenv"
brew "shellcheck"
brew "ship"
brew "sl"
brew "stern"
brew "terraform-docs"
brew "terraform_landscape"
brew "tfenv"
brew "tflint"
brew "tmate"
brew "tmux"
brew "tmuxinator-completion"
brew "tree"
brew "vault"
#brew "vaulted"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "wireshark"
brew "youtube-dl"
brew "yq"
brew "zsh-completions"

brew "argoproj/tap/argocd"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "aws/tap/aws-sam-cli"
brew "aylei/tap/kubectl-debug"
#brew "azure/aks-engine/aks-engine"
#brew "azure/draft/draft"
brew "banzaicloud/tap/backyards-cli"
#brew "bazelbuild/tap/bazel"
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "fairwindsops/tap/pluto"
brew "hashicorp/tap/terraform-ls"
brew "kryptco/tap/kr"
brew "kube-score/tap/kube-score"
brew "liamg/tfsec/tfsec"
brew "nexeck/tmuxinator/tmuxinator"
brew "reconquest/tubekit/tubekit"
brew "teamookla/speedtest/speedtest"
#brew "versent/taps/saml2aws"
#brew "solo-io/tap/supergloo"


# Mac App Store CLI
mas "1Password 7", id: 1333542190
mas "Airmail", id: 918858936
mas "All-in-One Messenger", id: 1456462087
mas "Bandwidth+", id: 490461369
mas "Confluently", id: 1290720256
mas "Deliveries", id: 924726344
#mas "Disk Diag", id: 672206759
#mas "Disk Speed Test", id: 425264550
mas "Dynamo", id: 1445910651
#mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "iStat Menus", id: 1319778037
mas "iThoughtsX", id: 720669838
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
#mas "Multiscreen Multimouse", id: 1135196075
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Patterns", id: 429449079
mas "Pocket", id: 568494494
mas "RAR Extractor Lite", id: 646295438
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
#mas "Telegram Lite", id: 946399090
mas "Termius", id: 1176074088
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Transmit", id: 1436522307
mas "TweetDeck", id: 485812721
mas "Twitter", id: 1482454543
mas "USBclean", id: 907406031
mas "WhatsApp", id: 1147396723
mas "WiFi Signal", id: 525912054
#mas "LastPass", id: 926036361
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435


whalebrew "whalebrew/pwgen"
whalebrew "whalebrew/whalesay"
