==> Formulae

ack
aks-engine
antibody
autoconf
autoenv
autojump
awk
aws-iam-authenticator
aws-okta
aws-sam-cli
aws-shell
awscli
azure-cli
bash-completion
bazel
binaryen
cfssl
cmake
cowsay
ctop
direnv
emscripten
fortune
freetype
fzf
gdbm
gettext
git
glib
gnu-sed
gnu-tar
go
goenv
htop
icu4c
ilmbase
imagemagick
istioctl
jemalloc
jpeg
jq
k9s
kr
kube-score
kubebuilder
kubecfg
kubectx
kubernetes-cli
kubernetes-helm
kustomize
libde265
libevent
libffi
libheif
libidn2
libomp
libpng
libssh
libtermkey
libtiff
libtool
libunistring
libuv
libvterm
libyaml
little-cms2
lolcat
lua
luajit
mosh
msgpack
ncurses
neofetch
neovim
ngrep
node
oniguruma
openexr
openjpeg
openssl
openssl@1.1
pcre
pcre2
perl
pipenv
pkg-config
pre-commit
protobuf
pyenv
python
python@2
ranger
rbenv
readline
reattach-to-user-namespace
ruby
ruby-build
sbtenv
screenresolution
shared-mime-info
ship
sphinx-doc
sqlite
stern
supergloo
terraform-docs
tfenv
tmate
tmux
tmuxinator
tmuxinator-completion
tree
tubekit
unibilium
vaulted
vim
watch
webp
wget
x265
xz
yuicompressor
zsh
zsh-completions
